---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsIllegalDesiredNumRisers
source: html/c4bc8ac8-cdd9-e9ef-4673-e3f8212ae7a6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsIllegalDesiredNumRisers Property

Desired Number of Risers is too small. Computed Actual Riser Height is greater than Maximum Riser Height allowed by type.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsIllegalDesiredNumRisers { get; }
```